paulbearne/Stm32h743Wifi/Core/Src/consoletask.c
/**
 ******************************************************************************
 * @file         console.c
 * @author       Aaron Escoboza, Github account: https://github.com/aaron-ev
 * @brief        Command Line Interpreter based on FreeRTOS and STM32 HAL layer
 ******************************************************************************
 */

#include <consoletask.h>
#include "FreeRTOS.h"
#include "task.h"
#include "FreeRTOS_CLI.h"
#include "queue.h"
#include "stm32h7xx_hal.h"
#include "bspRtc.h"
#include "bspGpio.h"
#include "bspPwm.h"
#include "stdio.h"
#include "stdlib.h"
#include "string.h"
#include "cmsis_os.h"
#include "tusb.h"
#include "tusb_config.h"
#include "bspClk.h"
#include "adc.h"
#include "event_groups.h"
#include "fatfs.h"
#include "ff.h"
#include "main.h"
#include "bspcamera.h"

#define CONSOLE_VERSION_MAJOR                   1
#define CONSOLE_VERSION_MINOR                   0

#define MAX_IN_STR_LEN                          300
#define MAX_OUT_STR_LEN                         600
#define MAX_RX_QUEUE_LEN                        300

/* ASCII code definition */
#define ASCII_TAB                               '\t'  /* Tabulate              */
#define ASCII_CR                                '\r'  /* Carriage return       */
#define ASCII_LF                                '\n'  /* Line feed             */
#define ASCII_BACKSPACE                         '\b'  /* Back space            */
#define ASCII_FORM_FEED                         '\f'  /* Form feed             */
#define ASCII_DEL                               127   /* Delete                */
#define ASCII_CTRL_PLUS_C                         3   /* CTRL + C              */
#define ASCII_NACK                               21   /* Negative acknowledge  */

#define CHUNK_SIZE 64

adc_data_t adcData;
camera_t cameraData;
char cRxData;
typedef enum {
	CDCWAITCONNECT, CDCWAITCHAR, CDCFIRSTCONNECT, CDCDISCONNECT, CDCPROCESSCHAR
} connect_state_t;

typedef struct {
	char *command;
	char *help;
	uint8_t paramcount;
	int8_t min;
	int8_t max;
} camera_commands_t;

EventGroupHandle_t Send_Complete_Handle;
extern osMessageQId adcQueueHandle;

const int SEND_COMPLETE_BIT = 0x000000001;
static char *pcWelcomeMsg =
		"Welcome to the console. Enter 'help' to view a list of available commands.\n";

static const char *prvpcTaskListHeader =
		"Task states: Bl = Blocked, Re = Ready, Ru = Running, De = Deleted,  Su = Suspended\n\n"
				"Task name         State  Priority  Stack remaining  CPU usage  Runtime(us)\n"
				"================= =====  ========  ===============  =========  ===========\n";
static char *prvpcPrompt = "#cmd: ";

/* Command function prototypes */
void safe_cdc_write_const(char message[], uint32_t message_size);
static BaseType_t prvCommandWifiDataReadyState(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandWifiHandShakeState(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandPwmSetFreq(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandPwmSetDuty(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandGpioWrite(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandGpioRead(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandEcho(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandTaskStats(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandHeap(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandTicks(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandRtcGet(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandRtcSet(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandVersion(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandVref(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandBat(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandTemperature(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandAdc(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandMkdir(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandMount(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandFormat(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandDel(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandRename(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandDir(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandRmdir(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandPrune(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandCd(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandCwd(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
static BaseType_t prvCommandClearScreen(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString);
static BaseType_t prvCommandCamera(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString);
/**
 *   @brief  This function is executed in case of error occurrence.
 *   @retval None
 */

static const char* prvpcMapTaskState(eTaskState eState) {
	switch (eState) {
	case eReady:
		return "Re";
	case eRunning:
		return "Ru";
	case eDeleted:
		return "De";
	case eBlocked:
		return "Bl";
	case eSuspended:
		return "S";
	default:
		return "??";
	}
}

