paulbearne/Stm32h743Wifi/Core/Src/consoletask.c
static const CLI_Command_Definition_t xCommands[] =
		{
				{ "stats",
						"stats:\r\n \tDisplays a table with the state of each FreeRTOS task.",
						prvCommandTaskStats, 0 }, { "wifihsstate",
						"\r\nwifihsstate:\r\n \tRead wifi handshake pin state.",
						prvCommandWifiHandShakeState, 0 }, { "wifidrstate",
						"\r\nwifidrstate:\r\n \tRead wifi dataready pin state.",
						prvCommandWifiDataReadyState, 0 },
				{ "gpiowrite",
						"\r\ngpiowrite <gpio port> <pin number> <logical value>:\r\n \tWrite a digital value to GPIO pin.",
						prvCommandGpioWrite, 3 },
				{ "gpioread",
						"\r\ngpioread <gpio port> <pin number>:\r\n \tRead a GPIO pin.",
						prvCommandGpioRead, 2 }, { "echo",
						"\r\necho <string to echo>:\r\n \tdisplays a string.",
						prvCommandEcho, 1 },
				{ "pwmfreq",
						"\r\npwmfreq <Channel> <Frequency>:\r\n \tSet a new frequency. Valid Channels 0 to 3",
						prvCommandPwmSetFreq, 1 },
				{ "pwmduty",
						"\r\npwmduty <Channel> <Duty cycle> Channel>:\r\n \tSet a new PWM duty cycle of a giving channel.\r\n \tValid Channels 0 to 3",
						prvCommandPwmSetDuty, 2 }, { "heap",
						"\r\nheap:\r\n \tDisplay free heap memory.",
						prvCommandHeap, 0 },
				{ "ticks",
						"\r\nticks:\r\n \tDisplay OS tick count and run time in seconds.",
						prvCommandTicks, 0 }, { "vref",
						"\r\nvref:\r\n \tDisplay ADC Referance Voltage",
						prvCommandVref, 0 }, { "vbat",
						"\r\nvbat:\r\n \tDisplay ADC Battery Voltage",
						prvCommandBat, 0 }, { "temp",
						"\r\ntemp:\r\n \tDisplay ADC Cpu Temperature",
						prvCommandTemperature, 0 },
				{ "adc",
						"\r\nadc <Channel>:\r\n \tDisplay ADC Channel x Value channel 0 to 3",
						prvCommandAdc, 1 },
				{ "camera",
						"\r\ncamera <cameracommand>:\r\n \tGet Camera information\r\ncamera <cameracommand> <value>:\r\n \tSet camera parameter",
						prvCommandCamera, -1 }, { "gettime",
						"\r\ngettime:\r\n \tGet the current time",
						prvCommandRtcGet, 0 },
				{ "settime",
						"\r\nsettime <Hours> <Minutes> <Seconds>:\r\n \tSet a new time",
						prvCommandRtcSet, 3 }, { "mount",
						"\r\nmount:\r\n \tmount SD card", prvCommandMount, 0 },
				{ "format", "\r\nformat:\r\n \tFormat the SD card",
						prvCommandFormat, 0 },
				{ "cd",
						"\r\ncd <path>:\r\n \tchange the current directory on the SD card",
						prvCommandCd, 1 },
				{ "cwd",
						"\r\ncwd <path>:\r\n \tget the current directory on the SD card",
						prvCommandCwd, 0 },
				{ "mkdir",
						"\r\nmkdir <dirname>:\r\n \tCreate a new directory on SD card",
						prvCommandMkdir, 1 }, { "del",
						"\r\ndel <filename>:\r\n \tDelete file from SD card",
						prvCommandDel, 1 },
				{ "rmdir",
						"\r\nrmdir <path>:\r\n \tDelete empty directory from SD card",
						prvCommandRmdir, 1 },
				{ "prune",
						"\r\nprune <path>:\r\n \tDelete a non empty directory SD card",
						prvCommandPrune, 1 },
				{ "dir",
						"\r\ndir:\ndir <path>:\r\n \tDirectory listing of SD card",
						prvCommandDir, -1 },
				{ "ls",
						"\r\nls:\nls <path>:\r\n \tDirectory listing of SD card",
						prvCommandDir, -1 },
				{ "ren",
						"\r\nren <filename> <newfilename>:\r\n \tRename file on the SD card",
						prvCommandRename, 2 }, { "cls",
						"\r\ncls:\r\n \tClear the terminal window.",
						prvCommandClearScreen, 0 }, { "version",
						"\r\nversion:\r\n \tGet firmware version",
						prvCommandVersion, 0 }, { NULL, NULL, NULL, 0 } };

static camera_commands_t cameraCommands[] =
{
		{ "fps", "\r\ncamera fps:\r\n \tshow the camera frames pwer second",
				0, -1, -1 },
		{ "id", "\r\ncamera id:\r\n \tshow the camera id",
				0, -1, -1 },
		{ "type",
				"\r\ncamera type:\r\n \tshow the camera type", 0, -1, -1 },
		{ "colorbar",
				"\r\ncamera colorbar <on/off>:\r\n \tturn the camera test card on or off",
						2, 0, 1 },
		{ "effect",
					"\r\ncamera effect <0-8>:\r\n \tcamera special effect", 2, 0, 8 },
					{NULL,NULL,0,-1,-1}
};


static const char* getSdStatusStr(FRESULT res) {
	const char *sdresultstr =
			"OK\0" "DISK_ERR\0" "INT_ERR\0" "NOT_READY\0" "NO_FILE\0" "NO_PATH\0"
					"INVALID_NAME\0" "DENIED\0" "EXIST\0" "INVALID_OBJECT\0" "WRITE_PROTECTED\0"
					"INVALID_DRIVE\0" "NOT_ENABLED\0" "NO_FILE_SYSTEM\0" "MKFS_ABORTED\0" "TIMEOUT\0"
					"LOCKED\0" "NOT_ENOUGH_CORE\0" "TOO_MANY_OPEN_FILES\0" "INVALID_PARAMETER\0";
	for (int i = 0; i != res && *sdresultstr; i++) {
		while (*sdresultstr++)
			;
	}
	return sdresultstr;
}

static BaseType_t prvCommandCamera(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	BaseType_t xParamLen;
	uint32_t paramcount = prvGetNumberOfParameters(pcCommandString);
	const char *cmd = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
	if (paramcount == 1) {
		// handle get command
		if (strcmp(cmd, "fps") == 0) {
			snprintf((char*) pcWriteBuffer, xWriteBufferLen, "%d FPS\n",
					(int) cameraData.fps);
			return pdFALSE;
		}
		if (strcmp(cmd, "id") == 0) {
			snprintf((char*) pcWriteBuffer, xWriteBufferLen, "Camera ID 0x%x\n",
					(int) cameraData.id);
			return pdFALSE;
		}
		if (strcmp(cmd, "type") == 0) {
			switch (cameraData.type) {
			case 0:
				strcpy(pcWriteBuffer, "Camera is unknown\n");
				break;
			case 1:
				strcpy(pcWriteBuffer, "Camera type is OV2640\n");
				break;
			case 2:
				strcpy(pcWriteBuffer, "Camera type is OV5640\n");
				break;
			case 3:
				strcpy(pcWriteBuffer, "Camera type is OV7670\n");
				break;
			case 4:
				strcpy(pcWriteBuffer, "Camera type is OV7725\n");
				break;
			default:
				strcpy(pcWriteBuffer, "Camera is unknown\n");
			}
			return pdFALSE;
		}
		if (strcmp(cmd,"help")==0){
			int i=0;
			do{
				strcpy(pcWriteBuffer,cameraCommands[i].help);
				safe_cdc_write_const(pcWriteBuffer, strlen(pcWriteBuffer));
				memset(pcWriteBuffer, 0x00, MAX_OUT_STR_LEN);
				i++;
			} while(cameraCommands[i].command != NULL);
			strcpy(pcWriteBuffer,"\n");
			return pdFALSE;

		}
	} else if (paramcount == 2) {
		//set command
		const char *action = FreeRTOS_CLIGetParameter(pcCommandString, 2,
				&xParamLen);
		if (strncmp(cmd, "colorbar",8) == 0) {
			if (strcmp(action, "on") == 0) {
				bspCameraSetColorbar(1);
				strcpy(pcWriteBuffer, "Camera colorbar is on\n");
				return pdFALSE;
			} else {
				bspCameraSetColorbar(0);
				strcpy(pcWriteBuffer, "Camera colorbar is off\n");
				return pdFALSE;
			}
		}
		if (strncmp(cmd, "effects",7) == 0) {
			int val = atoi(action);
			bspCameraSetSpecialEffects(val);
			sprintf(pcWriteBuffer, "Camera special effect set to %d\n",val);
			return pdFALSE;
		}
	} else {
		// wrong number of parameters
		strncpy(pcWriteBuffer,
				"Incorrect command parameter(s).  Enter \"camera help\" to view a list of available camera commands.\r\n\r\n",
				xWriteBufferLen);
		return pdFALSE;
	}
	strncpy((char*) pcWriteBuffer,
			"Camera command not found. \r\nEnter \"camera help\" to view a list of available camera commands.\r\n\r\n",
			xWriteBufferLen);
	return pdFALSE;
}

static BaseType_t prvCommandClearScreen(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString) {
	snprintf(pcWriteBuffer, xWriteBufferLen, "\x1b[2J\x1b[H");
	return pdFALSE;
}

static BaseType_t prvCommandWifiHandShakeState(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString) {
	BspPinNum_e bspPinNum = 8;
	BspGpioPinState_e xPinState;
	BspGpioInstance_e bspGpioInstance;
	bspGpioInstance = bspGpioMapInstance('d');  // port d 8
	xPinState = bspGpioRead(bspGpioInstance, bspPinNum);
	snprintf(pcWriteBuffer, xWriteBufferLen, "WIFI Handshake State: %d\n",
			xPinState);
	return pdFALSE;
}

