paulbearne/Stm32h743Wifi/Core/Src/consoletask.c
static BaseType_t prvCommandWifiDataReadyState(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString) {
	BspPinNum_e bspPinNum = 9;
	BspGpioPinState_e xPinState;
	BspGpioInstance_e bspGpioInstance;
	bspGpioInstance = bspGpioMapInstance('d');  // port d 8
	xPinState = bspGpioRead(bspGpioInstance, bspPinNum);
	snprintf(pcWriteBuffer, xWriteBufferLen, "WIFI DataReady State: %d\n",
			xPinState);
	return pdFALSE;
}
/**
 * @brief Command that gets task statistics.
 * @param *pcWriteBuffer FreeRTOS CLI write buffer.
 * @param xWriteBufferLen Length of write buffer.
 * @param *pcCommandString pointer to the command name.
 * @retval FreeRTOS status
 */
static BaseType_t prvCommandTaskStats(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString) {
	static uint32_t uTaskIndex = 0;
	static uint32_t uTotalOfTasks = 0;
	static uint32_t uTotalRunTime = 1;
	TaskStatus_t *pxTmpTaskStatus = NULL;
	static TaskStatus_t *pxTaskStatus = NULL;

	if (pxTaskStatus == NULL) {
		uTotalOfTasks = uxTaskGetNumberOfTasks();
		pxTaskStatus = pvPortMalloc(uTotalOfTasks * sizeof(TaskStatus_t));
		if (pxTaskStatus == NULL) {
			snprintf(pcWriteBuffer, xWriteBufferLen,
					"Error: Not enough memory 3 for task allocation");
			goto out_cmd_task_stats;
		}
		uTotalOfTasks = uxTaskGetSystemState(pxTaskStatus, uTotalOfTasks,
				&uTotalRunTime);
		uTaskIndex = 0;
		uTotalRunTime /= 100;
		snprintf(pcWriteBuffer, xWriteBufferLen, prvpcTaskListHeader);
	} else {
		memset(pcWriteBuffer, 0x00, MAX_OUT_STR_LEN);
		/* Prevent from zero division */
		if (!uTotalRunTime) {
			uTotalRunTime = 1;
		}

		pxTmpTaskStatus = &pxTaskStatus[uTaskIndex];
		if (pxTmpTaskStatus->ulRunTimeCounter / uTotalRunTime < 1) {
			snprintf(pcWriteBuffer, xWriteBufferLen,
					"%-16s  %5s  %8lu  %14dB       < 1%%  %11lu\n",
					pxTmpTaskStatus->pcTaskName,
					prvpcMapTaskState(pxTmpTaskStatus->eCurrentState),
					pxTmpTaskStatus->uxCurrentPriority,
					pxTmpTaskStatus->usStackHighWaterMark,
					pxTmpTaskStatus->ulRunTimeCounter);
		} else {
			snprintf(pcWriteBuffer, xWriteBufferLen,
					"%-16s  %5s  %8lu  %14dB  %8lu%%  %11lu\n",
					pxTmpTaskStatus->pcTaskName,
					prvpcMapTaskState(pxTmpTaskStatus->eCurrentState),
					pxTmpTaskStatus->uxCurrentPriority,
					pxTmpTaskStatus->usStackHighWaterMark,
					pxTmpTaskStatus->ulRunTimeCounter / uTotalRunTime,
					pxTmpTaskStatus->ulRunTimeCounter);
		}
		uTaskIndex++;
	}

	/* Check if there is more tasks to be process */
	if (uTaskIndex < uTotalOfTasks)
		return pdTRUE;
	else {
		out_cmd_task_stats: if (pxTaskStatus != NULL) {
			vPortFree(pxTaskStatus);
			pxTaskStatus = NULL;
		}
		return pdFALSE;
	}
}

/**
 * @brief Command that writes to a GPIOx pin.
 * @param *pcWriteBuffer FreeRTOS CLI write buffer.
 * @param xWriteBufferLen Length of write buffer.
 * @param *pcCommandString pointer to the command name.
 * @retval FreeRTOS status
 */
static BaseType_t prvCommandGpioWrite(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString) {
	BaseType_t xParamLen;
	BspPinNum_e bspPinNum;
	const char *pcGpioPinNum;
	const char *pcGpioPinSate;
	const char *pcGpioInstance;
	BspGpioPinState_e bspPinState;
	BspGpioInstance_e bspGpioInstance;

	// Get GPIO instance and map it from data type char to BSP integer value
	pcGpioInstance = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
	bspGpioInstance = bspGpioMapInstance(*pcGpioInstance);
	if (bspGpioInstance >= BSP_MAX_GPIO_INSTANCE) {
		snprintf(pcWriteBuffer, xWriteBufferLen, "Error: invalid GPIO port\n");
		return pdFALSE;
	}
	// Get pin number
	pcGpioPinNum = FreeRTOS_CLIGetParameter(pcCommandString, 2, &xParamLen);
	bspPinNum = atoi(pcGpioPinNum);
	if (bspPinNum < BSP_GPIO_PIN_0 || bspPinNum > BSP_GPIO_PIN_15) {
		snprintf(pcWriteBuffer, xWriteBufferLen, "Error: invalid pin number\n");
		return pdFALSE;
	}
	// Get new pin state
	pcGpioPinSate = FreeRTOS_CLIGetParameter(pcCommandString, 3, &xParamLen);
	bspPinState = atoi(pcGpioPinSate);
	if (bspPinState > BSP_GPIO_PIN_HIGH) {
		snprintf(pcWriteBuffer, xWriteBufferLen, "Error: invalid pin state\n");
		return pdFALSE;;
	}
	/* Write the new pin state to the GPIO pin and fill FreeRTOS write buffer */
	bspGpioWrite(bspGpioInstance, bspPinNum, bspPinState);
	snprintf(pcWriteBuffer, xWriteBufferLen, "GPIO: %c, Pin: %d set to %d\n",
			*pcGpioInstance, (int) bspPinNum, bspPinState);

	return pdFALSE;
}

/**
 * @brief Command that reads from GPIOx Pin
 * @param *pcWriteBuffer FreeRTOS CLI write buffer.
 * @param xWriteBufferLen Length of write buffer.
 * @param *pcCommandString pointer to the command name.
 * @retval FreeRTOS status
 */
static BaseType_t prvCommandGpioRead(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString) {
	BaseType_t xParamLen;
	const char *pcGpioPinNum;
	const char *pcGpioInstance;
	BspPinNum_e bspPinNum;
	BspGpioPinState_e xPinState;
	BspGpioInstance_e bspGpioInstance;

	/* Get GPIO instance and map it from data type char to BSP integer value */
	pcGpioInstance = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
	bspGpioInstance = bspGpioMapInstance(*pcGpioInstance);
	if (bspGpioInstance >= BSP_MAX_GPIO_INSTANCE) {
		snprintf(pcWriteBuffer, xWriteBufferLen,
				"Error: invalid GPIO port should be a to \n");
		return pdFALSE;
	}
	/* Get pin number */
	pcGpioPinNum = FreeRTOS_CLIGetParameter(pcCommandString, 2, &xParamLen);
	bspPinNum = atoi(pcGpioPinNum);
	if (bspPinNum < BSP_GPIO_PIN_0 || bspPinNum > BSP_GPIO_PIN_15) {
		snprintf(pcWriteBuffer, xWriteBufferLen,
				"Error: \r\ninvalid pin number value should be between 0 and 15\n");
		return pdFALSE;
	}
	/* Read pin state and fill FreeRTOS write buffer */
	xPinState = bspGpioRead(bspGpioInstance, bspPinNum);
	snprintf(pcWriteBuffer, xWriteBufferLen, "GPIO: %c Pin: %d state: %d\n",
			*pcGpioInstance, (int) bspPinNum, xPinState);

	return pdFALSE;
}

/**
 * @brief Echo command line in UNIX systems.
 * @param *pcWriteBuffer FreeRTOS CLI write buffer.
 * @param xWriteBufferLen Length of write buffer.
 * @param *pcCommandString pointer to the command name.
 * @retval FreeRTOS status
 */
static BaseType_t prvCommandEcho(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	const char *pcStrToOutput;
	BaseType_t xParamLen;

	/* Get the user input and write it back the FreeRTOS write buffer */
	pcStrToOutput = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
	snprintf(pcWriteBuffer, xWriteBufferLen, "%s\n", pcStrToOutput);

