paulbearne/Stm32h743Wifi/Core/Src/consoletask.c
	return pdFALSE;
}

/**
 * @brief Command that sets a new pwm frequency.
 * @param *pcWriteBuffer FreeRTOS CLI write buffer.
 * @param xWriteBufferLen Length of write buffer.
 * @param *pcCommandString pointer to the command name.
 * @retval FreeRTOS status
 */
static BaseType_t prvCommandPwmSetFreq(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString) {
	const char *pcFreq;
	BaseType_t xParamLen;
	pwmerror_t bspStatus;

	pcFreq = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
	bspStatus = bspPwmSetFreq(atoi(pcFreq));
	if (bspStatus == PwmFrequencyError) {
		snprintf(pcWriteBuffer, xWriteBufferLen, "Error: Invalid parameter\n");
	} else if (bspStatus == PwmHalError) {
		snprintf(pcWriteBuffer, xWriteBufferLen, "Error: Hal Error\n");
	} else {
		snprintf(pcWriteBuffer, xWriteBufferLen, "Frequency set to %dHz\n",
				atoi(pcFreq));
	}
	return pdFALSE;
}

/**
 * @brief Command that sets a new pwm duty cycle.
 * @param *pcWriteBuffer FreeRTOS CLI write buffer.
 * @param xWriteBufferLen Length of write buffer.
 * @param *pcCommandString pointer to the command name.
 * @retval FreeRTOS status
 */
static BaseType_t prvCommandPwmSetDuty(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString) {
	pwmerror_t bspStatus;
	BaseType_t xParamLen;
	const char *pcChannel;
	const char *pcDutyCycle;

	pcDutyCycle = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
	pcChannel = FreeRTOS_CLIGetParameter(pcCommandString, 2, &xParamLen);

	/* Index starts at index 0, so 1 is subtracted from channel */
	bspStatus = bspPwmSetDuty(atoi(pcDutyCycle), atoi(pcChannel) - 1);
	if (bspStatus == PwmChannelError)
		snprintf(pcWriteBuffer, xWriteBufferLen, "Error: Invalid parameter\n");
	else
		snprintf(pcWriteBuffer, xWriteBufferLen,
				"Channel %d set to %d%% duty cycle \n", atoi(pcChannel),
				atoi(pcDutyCycle));
	//snprintf(pcWriteBuffer, xWriteBufferLen, "Error: Not Implemented yet\n");
	return pdFALSE;
}

/**
 * @brief Command that gets heap information
 * @param *pcWriteBuffer FreeRTOS CLI write buffer.
 * @param xWriteBufferLen Length of write buffer.
 * @param *pcCommandString pointer to the command name.
 * @retval FreeRTOS status
 */
static BaseType_t prvCommandHeap(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {

	size_t xHeapFree;
	size_t xHeapMinMemExisted;

	xHeapFree = xPortGetFreeHeapSize();
	xHeapMinMemExisted = xPortGetMinimumEverFreeHeapSize();
	snprintf(pcWriteBuffer, xWriteBufferLen,
			"Heap size            : %3u bytes (%3d KiB)\nRemaining            : %3u bytes (%3d KiB)\nMinimum ever existed : %3u bytes (%3d KiB)\n",
			configTOTAL_HEAP_SIZE, configTOTAL_HEAP_SIZE / 1024, xHeapFree,
			xHeapFree / 1024, xHeapMinMemExisted, xHeapMinMemExisted / 1024);

	return pdFALSE;
}

/**
 * @brief Command that calculate OS ticks information.
 * @param *pcWriteBuffer FreeRTOS CLI write buffer.
 * @param xWriteBufferLen Length of write buffer.
 * @param *pcCommandString pointer to the command name.
 * @retval FreeRTOS status
 */
static BaseType_t prvCommandTicks(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	uint32_t uMs;
	uint32_t uSec;
	TickType_t xTickCount = xTaskGetTickCount();

	uSec = xTickCount / configTICK_RATE_HZ;
	uMs = xTickCount % configTICK_RATE_HZ;
	snprintf(pcWriteBuffer, xWriteBufferLen,
			"Tick rate: %u Hz\nTicks: %lu\nRun time: %lu.%.3lu seconds\n",
			(unsigned) configTICK_RATE_HZ, xTickCount, uSec, uMs);

	return pdFALSE;
}

/**
 * @brief Get the current time stored in RTC registers
 * @param *pcWriteBuffer FreeRTOS CLI write buffer.
 * @param xWriteBufferLen Length of write buffer.
 * @param *pcCommandString pointer to the command name.
 * @retval FreeRTOS status
 */
static BaseType_t prvCommandRtcGet(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	bsp_rtc_datetime_t bspRtcDateTime;
	bsp_rtc_error_t bspStatus;

	bspStatus = bspRtcGetTime(&bspRtcDateTime);
	if (bspStatus != RtcOK)
		snprintf(pcWriteBuffer, xWriteBufferLen,
				"Error: Could not get current time\n");

	snprintf(pcWriteBuffer, xWriteBufferLen,
			"Time (24hr format): %02u:%02u:%02u\n", bspRtcDateTime.uHours,
			bspRtcDateTime.uMinutes, bspRtcDateTime.uSeconds);

	return pdFALSE;
}

/**
 * @brief Set a new time in RCT registers
 * @param *pcWriteBuffer FreeRTOS CLI write buffer.
 * @param xWriteBufferLen Length of write buffer.
 * @param *pcCommandString pointer to the command name.
 * @retval FreeRTOS status
 */
static BaseType_t prvCommandRtcSet(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	const char *cHours;
	const char *cMinutes;
	const char *cSeconds;
	BaseType_t xParamLen;
	bsp_rtc_error_t bspStatus;
	bsp_rtc_datetime_t bspRtcDateTime;

	cHours = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
	cMinutes = FreeRTOS_CLIGetParameter(pcCommandString, 2, &xParamLen);
	cSeconds = FreeRTOS_CLIGetParameter(pcCommandString, 3, &xParamLen);

	bspRtcDateTime.uHours = atoi(cHours);
	bspRtcDateTime.uMinutes = atoi(cMinutes);
	bspRtcDateTime.uSeconds = atoi(cSeconds);

	bspStatus = bspRtcSetTime(&bspRtcDateTime);
	if (bspStatus == SetTimeError) {
		snprintf(pcWriteBuffer, xWriteBufferLen, "Error: Invalid parameters\n");
		return pdFALSE;
	} else if (bspStatus != RtcOK) {
		snprintf(pcWriteBuffer, xWriteBufferLen, "Error: I/O\n");
		return pdFALSE;
	} else {
		snprintf(pcWriteBuffer, xWriteBufferLen,
				"Time (24hr format) set to: %02u:%02u:%02u\n",
				bspRtcDateTime.uHours, bspRtcDateTime.uMinutes,
				bspRtcDateTime.uSeconds);
	}

	return pdFALSE;
}

/**
 * @brief Get current console version
 * @param *pcWriteBuffer FreeRTOS CLI write buffer.
 * @param xWriteBufferLen Length of write buffer.
 * @param *pcCommandString pointer to the command name.
 * @retval FreeRTOS status
 */
static BaseType_t prvCommandVersion(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	snprintf(pcWriteBuffer, xWriteBufferLen, "%d.%d\n",
			(uint8_t) (CONSOLE_VERSION_MAJOR),
			(uint8_t) (CONSOLE_VERSION_MINOR));
	return pdFALSE;
}

