paulbearne/Stm32h743Wifi/Core/Src/consoletask.c
static BaseType_t prvCommandVref(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {

	snprintf((char*) pcWriteBuffer, xWriteBufferLen, " Vref: %4dmV\n",
			(int) adcData.vrefint);
	return pdFALSE;

}

static BaseType_t prvCommandBat(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	snprintf((char*) pcWriteBuffer, xWriteBufferLen, " vbat: %4dmV\n",
			(int) adcData.vbat);
	return pdFALSE;
}

static BaseType_t prvCommandTemperature(char *pcWriteBuffer,
		size_t xWriteBufferLen, const char *pcCommandString) {
	snprintf((char*) pcWriteBuffer, xWriteBufferLen, " temp: %3d 'C\n",
			(int) adcData.tempsensor);
	return pdFALSE;
}

static BaseType_t prvCommandAdc(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	BaseType_t xParamLen;
	const char *channel = FreeRTOS_CLIGetParameter(pcCommandString, 1,
			&xParamLen);
	int channelnumber = atoi(channel);
	char formatstr[30] = { 0 };
	uint32_t adcvalue = 0;
	if (channelnumber < 0 || channelnumber > 3) {
		snprintf(pcWriteBuffer, xWriteBufferLen, "Error: Invalid parameters\n");
		return pdFALSE;
	}
	switch (channelnumber) {
	case 0:
		adcvalue = adcData.adc3_inp0;
		strcpy(formatstr, " PC2: %4dmV\n");
		break;
	case 1:
		adcvalue = adcData.adc3_inp1;
		strcpy(formatstr, " PC3: %4dmV\n");
		break;
	case 2:
		adcvalue = adcData.adc3_inp2;
		strcpy(formatstr, " PC0: %4dmV\n");
		break;
	case 3:
		adcvalue = adcData.adc3_inp3;
		strcpy(formatstr, " PC1: %4dmV\n");
		break;
	}

	snprintf((char*) pcWriteBuffer, xWriteBufferLen, formatstr, (int) adcvalue);
	return pdFALSE;
}

static BaseType_t prvCommandFormat(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	FRESULT res;
	uint8_t buf[_MAX_SS];
	osMutexWait(SDMutexHandle, osWaitForever);
	res = f_mkfs("", FM_ANY, 0, buf, sizeof(buf));
	if (res != FR_OK) {
		osMutexRelease(SDMutexHandle);
		sprintf((char*) pcWriteBuffer, " Error: %s\n", getSdStatusStr(res));
		return pdFALSE;
	}
	// formatted ok so mount it
	res = f_mount(&SDFatFS, "", 0);
	if (res != FR_OK) {
		osMutexRelease(SDMutexHandle);
		sprintf((char*) pcWriteBuffer, " Error: %s\n", getSdStatusStr(res));
		return pdFALSE;
	}
	osMutexRelease(SDMutexHandle);
	sprintf((char*) pcWriteBuffer, "Sd Card Formatted and Mounted Ok\n");
	return pdFALSE;
}

static BaseType_t prvCommandMount(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	FRESULT res;
	osMutexWait(SDMutexHandle, osWaitForever);
	res = f_mount(&SDFatFS, "", 0);
	if (res != FR_OK) {
		osMutexRelease(SDMutexHandle);
		sprintf((char*) pcWriteBuffer, " Error: %s\n", getSdStatusStr(res));
		return pdFALSE;
	}
	osMutexRelease(SDMutexHandle);
	sprintf((char*) pcWriteBuffer, "Sd Card Mounted Ok\n");
	return pdFALSE;
}

static BaseType_t prvCommandCd(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	BaseType_t xParamLen;
	FRESULT res;
	const char *dirname = FreeRTOS_CLIGetParameter(pcCommandString, 1,
			&xParamLen);
	osMutexWait(SDMutexHandle, osWaitForever);
	res = f_chdir(dirname);
	if (res != FR_OK) {
		osMutexRelease(SDMutexHandle);
		sprintf((char*) pcWriteBuffer, " Error: %s\n", getSdStatusStr(res));
		return pdFALSE;
	}
	osMutexRelease(SDMutexHandle);
	sprintf((char*) pcWriteBuffer, " Ok\n");
	return pdFALSE;
}

static BaseType_t prvCommandCwd(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	FRESULT res;
	UINT sz = 0;
	char path[_MAX_LFN + 1] = { 0 };

	osMutexWait(SDMutexHandle, osWaitForever);
	sz = sizeof(path);
	res = f_getcwd(path, sz);
	if (res != FR_OK) {
		osMutexRelease(SDMutexHandle);
		sprintf((char*) pcWriteBuffer, "Disk Error: %s\n", getSdStatusStr(res));
		return pdFALSE;
	}
	osMutexRelease(SDMutexHandle);
	sprintf((char*) pcWriteBuffer, "Current path is %s\n", path);
	return pdFALSE;
}

static BaseType_t prvCommandMkdir(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	BaseType_t xParamLen;
	const char *dirname = FreeRTOS_CLIGetParameter(pcCommandString, 1,
			&xParamLen);
	osMutexWait(SDMutexHandle, osWaitForever);
	FRESULT res = f_mkdir(dirname);
	if (res != FR_OK) {
		osMutexRelease(SDMutexHandle);
		sprintf((char*) pcWriteBuffer, " Disk Error: %s\n",
				getSdStatusStr(res));
		return pdFALSE;
	}
	osMutexRelease(SDMutexHandle);
	sprintf((char*) pcWriteBuffer, "%s Directory Created\n", dirname);
	return pdFALSE;
}

static BaseType_t prvCommandDel(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	BaseType_t xParamLen;
	const char *filename = FreeRTOS_CLIGetParameter(pcCommandString, 1,
			&xParamLen);
	osMutexWait(SDMutexHandle, osWaitForever);
	FRESULT res = f_unlink(filename);
	if (res != FR_OK) {
		osMutexRelease(SDMutexHandle);
		sprintf((char*) pcWriteBuffer, " Disk Error: %s\n",
				getSdStatusStr(res));
		return pdFALSE;
	}
	osMutexRelease(SDMutexHandle);
	sprintf((char*) pcWriteBuffer, "%s Deleted\n", filename);
	return pdFALSE;
}

static BaseType_t prvCommandRmdir(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	BaseType_t xParamLen;
	FRESULT res;
	DIR dir;

	const char *path = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
	osMutexWait(SDMutexHandle, osWaitForever);

	res = f_opendir(&dir, path);
	if (res != FR_OK) {
		osMutexRelease(SDMutexHandle);
		sprintf((char*) pcWriteBuffer, " %s is not a directory\n", path);
		return pdFALSE;
	}

	res = f_unlink(path);
	if (res != FR_OK) {
		osMutexRelease(SDMutexHandle);
		sprintf((char*) pcWriteBuffer,
				" %s is not empty use prune to remove it and its contents\n",
				path);
		return pdFALSE;
	}
	osMutexRelease(SDMutexHandle);
	sprintf((char*) pcWriteBuffer, " %s Deleted\n", path);
	return pdFALSE;
}

FRESULT delete_node(TCHAR *path, /* Path name buffer with the sub-directory to delete */
UINT sz_buff, /* Size of path name buffer (items) */
FILINFO *fno /* Name read buffer */
) {
	UINT i, j;
	FRESULT res;
	DIR dir;

	res = f_opendir(&dir, path); /* Open the sub-directory to make it empty */
	if (res != FR_OK) {
		return res;
	}

	for (i = 0; path[i]; i++)
		; /* Get current path length */
	path[i++] = _T('/');

