paulbearne/Stm32h743Wifi/Core/Src/consoletask.c
	for (;;) {
		res = f_readdir(&dir, fno); /* Get a directory item */
		if (res != FR_OK || !fno->fname[0]) {
			break; /* End of directory? */
		}
		j = 0;
		do { /* Make a path name */
			if (i + j >= sz_buff) { /* Buffer over flow? */
				res = 100;
				break; /* Fails with 100 when buffer overflow */
			}
			path[i + j] = fno->fname[j];
		} while (fno->fname[j++]);
		if (fno->fattrib & AM_DIR) { /* Item is a sub-directory */
			res = delete_node(path, sz_buff, fno);
		} else { /* Item is a file */
			res = f_unlink(path);
		}
		if (res != FR_OK) {
			break;
		}
	}

	path[--i] = 0; /* Restore the path name */
	f_closedir(&dir);

	if (res == FR_OK) {
		res = f_unlink(path); /* Delete the empty sub-directory */
	}
	return res;
}

static BaseType_t prvCommandPrune(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	BaseType_t xParamLen;
	FRESULT res;
	TCHAR buff[256];
	FILINFO Finfo;
	const char *path = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
	osMutexWait(SDMutexHandle, osWaitForever);
	strcpy(buff, path);

	// Delete the directory
	res = delete_node(buff, sizeof buff / sizeof buff[0], &Finfo);
	// Check the result
	if (res) {
		sprintf((char*) pcWriteBuffer, "Failed to delete the directory. (%u)\n",
				res);
	} else {
		sprintf((char*) pcWriteBuffer,
				" %s directory and the contents have successfully been deleted.\n",
				path);
	}
	osMutexRelease(SDMutexHandle);
	return pdFALSE;
}

static BaseType_t prvCommandRename(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	BaseType_t xParamLen;
	const char *filename = FreeRTOS_CLIGetParameter(pcCommandString, 1,
			&xParamLen);
	const char *newfilename = FreeRTOS_CLIGetParameter(pcCommandString, 2,
			&xParamLen);

	osMutexWait(SDMutexHandle, osWaitForever);
	FRESULT res = f_rename(filename, newfilename);
	if (res != FR_OK) {
		sprintf((char*) pcWriteBuffer, " Disk Error: %s\n",
				getSdStatusStr(res));
		return pdFALSE;
	}
	osMutexRelease(SDMutexHandle);
	sprintf((char*) pcWriteBuffer, "%s renamed to %s\n", filename, newfilename);
	return pdFALSE;
}

static BaseType_t prvCommandDir(char *pcWriteBuffer, size_t xWriteBufferLen,
		const char *pcCommandString) {
	BaseType_t xParamLen;
	const char *parampath;
	char path[_MAX_LFN + 1];
	DIR Dir;
	FATFS *fs;
	FRESULT res;
	FILINFO Finfo;
	DWORD dw;
	UINT sz = _MAX_LFN + 1;
	char fnamestr[_MAX_LFN + 1];
	uint32_t acc_size = 0;
	uint32_t acc_dirs = 0;
	uint32_t acc_files = 0;

	parampath = FreeRTOS_CLIGetParameter(pcCommandString, 1, &xParamLen);
	osMutexWait(SDMutexHandle, osWaitForever); //( SDMutexHandle, portMAX_DELAY );
	if (parampath == NULL) {
		res = f_getcwd(path, sz);
		if (res != FR_OK) {
			osMutexRelease(SDMutexHandle);
			sprintf((char*) pcWriteBuffer, " Disk Error: %s\n",
					getSdStatusStr(res));
			return pdFALSE;
		}
		//strcpy(path, "/");
	} else {
		strcat(path, parampath);
	}

	res = f_opendir(&Dir, path);
	if (res != FR_OK) {
		osMutexRelease(SDMutexHandle);
		sprintf((char*) pcWriteBuffer, " Disk Error: %s\n",
				getSdStatusStr(res));
		return pdFALSE;
	}

	//acc_size = acc_dirs = acc_files = 0;
	for (;;) {
		res = f_readdir(&Dir, &Finfo);
		if ((res != FR_OK) || !Finfo.fname[0]) {
			break; // finished so drop out of loop
		}
		if (Finfo.fattrib & AM_DIR) {
			acc_dirs++;
		} else {
			acc_files++;
			acc_size += Finfo.fsize;
		}
		strcpy(fnamestr, Finfo.fname);
		sprintf(pcWriteBuffer, "%c%c%c%c%c %u/%02u/%02u %02u:%02u %9lu  %s\n",
				(Finfo.fattrib & AM_DIR) ? 'D' : '-',
				(Finfo.fattrib & AM_RDO) ? 'R' : '-',
				(Finfo.fattrib & AM_HID) ? 'H' : '-',
				(Finfo.fattrib & AM_SYS) ? 'S' : '-',
				(Finfo.fattrib & AM_ARC) ? 'A' : '-', (Finfo.fdate >> 9) + 1980,
				(Finfo.fdate >> 5) & 15, Finfo.fdate & 31, (Finfo.ftime >> 11),
				(Finfo.ftime >> 5) & 63, (long unsigned int) Finfo.fsize,
				fnamestr);
		if ((Finfo.fattrib & AM_SYS) != AM_SYS) {
			safe_cdc_write_const(pcWriteBuffer, strlen(pcWriteBuffer));
		}
		memset(pcWriteBuffer, 0x00, MAX_OUT_STR_LEN);

	}

	sprintf((char*) pcWriteBuffer,
			"  %4u File(s)\t %u bytes total\n   %4u Dir(s)",
			(unsigned int) acc_files, (unsigned int) acc_size,
			(unsigned int) acc_dirs);
	safe_cdc_write_const(pcWriteBuffer, strlen(pcWriteBuffer));
	memset(pcWriteBuffer, 0x00, MAX_OUT_STR_LEN);
	res = f_getfree(path, (DWORD*) &dw, &fs);
	if (res == FR_OK) {
		char bytestr[10];
		char fmtstr[128];
		strcpy(fmtstr, " \t %.0f %s free\n");
		double sz = ((double) dw * (double) fs->csize) * 512.0;
		if (sz > (1 * 1024 * 1024 * 1024)) {
			sz = sz / 1024 / 1024 / 1024;
			strcpy(bytestr, "GB");
			strcpy(fmtstr, " \t %.1f  %s free\n");
		} else if (sz > (1 * 1024 * 1024)) {
			sz = sz / 1024 / 1024;
			strcpy(bytestr, "MB");
		} else {
			strcpy(bytestr, "bytes");
		}
		sprintf(pcWriteBuffer, fmtstr, sz, bytestr);
	} else {
		sprintf((char*) pcWriteBuffer, " Disk Error: %s\n",
				getSdStatusStr(res));
	}
	osMutexRelease(SDMutexHandle);
	return pdFALSE;
}

void safe_cdc_write_const(char message[], uint32_t message_size) {
	char *chunk = message;
	for (size_t i = 0; i + CHUNK_SIZE < message_size; i += CHUNK_SIZE)
	{
		xEventGroupClearBits(Send_Complete_Handle, SEND_COMPLETE_BIT);
		tud_cdc_write(chunk, CHUNK_SIZE);
		tud_cdc_write_flush();
		chunk += CHUNK_SIZE;
		xEventGroupWaitBits(Send_Complete_Handle, SEND_COMPLETE_BIT, false,
		true, portMAX_DELAY);
	}
	xEventGroupClearBits(Send_Complete_Handle, SEND_COMPLETE_BIT);
	tud_cdc_write(chunk, strlen(chunk));
	tud_cdc_write_flush();
	xEventGroupWaitBits(Send_Complete_Handle, SEND_COMPLETE_BIT, false, true,
	portMAX_DELAY);
}

// Invoked when cdc when line state changed e.g connected/disconnected
void tud_cdc_line_state_cb(uint8_t itf, bool dtr, bool rts) {
	(void) itf;
	(void) rts;

	// TODO set some indicator
	if (dtr) {
		// Terminal connected
	} else {
		// Terminal disconnected
	}
}

// Invoked when CDC interface received data from host
void tud_cdc_rx_cb(uint8_t itf) {
	(void) itf;
}

void tud_cdc_tx_complete_cb(uint8_t itf) {
	(void) itf;
	xEventGroupSetBits(Send_Complete_Handle, SEND_COMPLETE_BIT);
}

void tud_cdc_send_break_cb(uint8_t itf, uint16_t duration_ms) {

