paulbearne/Stm32h743Wifi/Core/Src/consoletask.c
}

void tud_cdc_line_coding_cb(uint8_t itf, cdc_line_coding_t const *p_line_coding) {

}

void tud_cdc_rx_wanted_cb(uint8_t itf, char wanted_char) {

}

/**
 * @brief Task to handle user commands via serial communication.
 * @param *pvParams Data passed at task creation.
 * @retval void
 */
void startCdcTask(void const *argument) {

	char cReadCh = '\0';
	connect_state_t cdcstate = CDCWAITCONNECT;
	//bool connected = false;
	//bool firstconnect = true;
	uint16_t uInputIndex = 0;
	BaseType_t xMoreDataToProcess;
	char pcInputString[MAX_IN_STR_LEN];
	char pcPrevInputString[MAX_IN_STR_LEN];
	char pcOutputString[MAX_OUT_STR_LEN];
	char asciiCmdStr[16];
	disp_data_t msg;
	memset(pcInputString, 0x00, MAX_IN_STR_LEN);
	memset(pcPrevInputString, 0x00, MAX_IN_STR_LEN);
	memset(pcOutputString, 0x00, MAX_OUT_STR_LEN);

	/* Create a queue to store characters from RX ISR */

	Send_Complete_Handle = xEventGroupCreate();

	xbspConsoleInit();

	while (1) {
		switch (cdcstate) {
		case CDCWAITCONNECT:
			if (tud_cdc_connected() == true) {
				cdcstate = CDCFIRSTCONNECT;
			}
			break;
		case CDCFIRSTCONNECT:
			//while (tud_cdc_connected() == false) {
			//		osDelay(100);
			strcpy(msg.str, "Cli Connected");
			xQueueSendToBack(displayQueueHandle, &msg, (TickType_t ) 10);
			cdcstate = CDCWAITCHAR;
			safe_cdc_write_const(pcWelcomeMsg, strlen(pcWelcomeMsg));
			safe_cdc_write_const(prvpcPrompt, strlen(prvpcPrompt));
			break;
		case CDCWAITCHAR:
			if (tud_cdc_available() == true) {
				cdcstate = CDCPROCESSCHAR;
			}
			//update the adc values while waiting
			if (uxQueueMessagesWaiting(adcQueueHandle)) {
				if (xQueueReceive(adcQueueHandle, &adcData,
						(TickType_t) 10) == pdPASS) {

				}
			}
			// update the camera fps
			if (uxQueueMessagesWaiting(cameraQueueHandle)) {
				if (xQueueReceive(cameraQueueHandle, &cameraData,
						(TickType_t) 10) == pdPASS) {

				}
			}
			// check if we have been disconnected
			if (tud_cdc_connected() == false) {
				cdcstate = CDCDISCONNECT;
			}
			break;

		case CDCPROCESSCHAR:
			tud_cdc_read(&cReadCh, sizeof(char));

			switch (cReadCh) {
			case ASCII_CR:
			case ASCII_LF:
				if (uInputIndex != 0) {
					strcpy(asciiCmdStr, "\n\n");
					safe_cdc_write_const(asciiCmdStr, strlen(asciiCmdStr));
					strncpy(pcPrevInputString, pcInputString, MAX_IN_STR_LEN);
					do {
						xMoreDataToProcess = FreeRTOS_CLIProcessCommand(
								pcInputString, /* Command string*/
								pcOutputString, /* Output buffer */
								MAX_OUT_STR_LEN /* Output buffer size */
								);
						safe_cdc_write_const(pcOutputString,
								strlen(pcOutputString));
					} while (xMoreDataToProcess != pdFALSE);
				}
				uInputIndex = 0;
				memset(pcInputString, 0x00, MAX_IN_STR_LEN);
				memset(pcOutputString, 0x00, MAX_OUT_STR_LEN);
				strcpy(asciiCmdStr, "\n");
				safe_cdc_write_const(asciiCmdStr, strlen(asciiCmdStr));
				safe_cdc_write_const(prvpcPrompt, strlen(prvpcPrompt));

				break;
			case ASCII_FORM_FEED:
				strcpy(asciiCmdStr, "\x1b[2J\x1b[0;0H\n");
				safe_cdc_write_const(asciiCmdStr, strlen(asciiCmdStr));
				safe_cdc_write_const(asciiCmdStr, strlen(prvpcPrompt));
				break;
			case ASCII_CTRL_PLUS_C:
				uInputIndex = 0;
				memset(pcInputString, 0x00, MAX_IN_STR_LEN);
				strcpy(asciiCmdStr, "\n");
				safe_cdc_write_const(asciiCmdStr, strlen(asciiCmdStr));
				safe_cdc_write_const(asciiCmdStr, strlen(prvpcPrompt));
				break;
			case ASCII_DEL:
			case ASCII_NACK:
			case ASCII_BACKSPACE:
				if (uInputIndex > 0) {
					uInputIndex--;
					pcInputString[uInputIndex] = '\0';
					strcpy(asciiCmdStr, "\b \b");
					safe_cdc_write_const(asciiCmdStr, strlen(asciiCmdStr));
				}
				break;
			case ASCII_TAB:
				while (uInputIndex) {
					uInputIndex--;
					strcpy(asciiCmdStr, "\b \b");
					safe_cdc_write_const(asciiCmdStr, strlen(asciiCmdStr));
				}
				strncpy(pcInputString, pcPrevInputString, MAX_IN_STR_LEN);
				uInputIndex = (unsigned char) strlen(pcInputString);
				safe_cdc_write_const(pcInputString, strlen(pcInputString));
				break;
			default:
				/* Check if read character is between [Space] and [~] in ASCII table */
				if (uInputIndex < (MAX_IN_STR_LEN - 1)
						&& (cReadCh >= 32 && cReadCh <= 126)) {
					pcInputString[uInputIndex] = cReadCh;
					safe_cdc_write_const((char*) &cReadCh, sizeof(char));
					uInputIndex++;
					//cReadCh = '\0';
				}
				break;
			}
			cdcstate = CDCWAITCHAR;
			break;
		case CDCDISCONNECT:
			strcpy(msg.str, "Cli Disconnected");
			xQueueSendToBack(displayQueueHandle, &msg, (TickType_t ) 10);
			cdcstate = CDCWAITCONNECT;
			break;
		}
		osDelay(10);
	}

}

/**
 * @brief Initialize the console by registering all commands and creating a task.
 * @param usStackSize Task console stack size
 * @param uxPriority Task console priority
 * @param *pxUartHandle Pointer for uart handle.
 * @retval FreeRTOS status
 */
void xbspConsoleInit(void) {
	const CLI_Command_Definition_t *pCommand;

	/* Register all commands that can be accessed by the user */
	for (pCommand = xCommands; pCommand->pcCommand != NULL; pCommand++) {
		FreeRTOS_CLIRegisterCommand(pCommand);
	}
}

/*void startCdcTask(void *argument) {

 xbspConsoleInit();
 //for (pCommand = xCommands; pCommand->pcCommand != NULL; pCommand++) {
 //		FreeRTOS_CLIRegisterCommand(pCommand);
 //}
 for (;;) {
 // There are data available
 //	while (tud_cdc_available()) {
 //		uint8_t buf[64];
 //		// read and echo back
 //		uint32_t count = tud_cdc_read(buf, sizeof(buf));
 //		(void) co  unt;
 //		tud_cdc_write(buf, count);
 //	}

 vTaskConsole();
 //tud_cdc_write_flush();
 osDelay(1);
 }

 }*/

/**
 * @brief Callback for UART RX, triggered any time there is a new character.
 * @param *huart Pointer to the uart handle.
 * @retval void
 */
//void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart) {
//BaseType_t pxHigherPriorityTaskWoken = pdFALSE;
//	if (xQueueRxHandle != NULL) {
//		xQueueSendToBackFromISR(xQueueRxHandle, &cRxData,
//				&pxHigherPriorityTaskWoken);
//	}
//	vConsoleEnableRxInterrupt();
//}
